artillery-load-testing/testDefinition/test.yml
config:
  target: "https://httpbin.org"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 10
      name: Warm up the API
    - duration: 120
      arrivalRate: 1
      rampTo: 20
      name: Ramp up to the peak load
    - duration: 240
      arrivalRate: 4
      name: Sustained the peak load

  plugins:
    fuzzer: {}
    metrics-by-endpoint: {useOnlyRequestNames: true}
    apdex: {} 
    threshold: 200

  ensure:
    thresholds:
    # p99 of response time must be <250:
      - "http.response_time.p99": 250
      # p95 of response time must be <100:
      - "http.response_time.p95": 100
      - "metric.name.one": value1
      - "metric.name.two": value2
    conditions:
      - expression: "metric.name.one <= value1 and metric.name.two > value2"
        strict: true|false # defaults to true

scenarios:
  - name: "Search Method API"
    flow:
      - get:
          url: "/#/HTTP_Methods"
      - think: 5    

  - name: "Search Authentication API"
    flow:
      - get:
          url: "/#/Auth"     
      - think: 5    

  - name: "Search Status Codes API"
    flow:
      - get:
          url: "/#/Status_codes"      
      - think: 5    

  - name: "Search Request Inspection API"
    flow:
      - get:
          url: "/#/Request_inspection"        
      - think: 5   

  - name: "Search Response Inspection API"
    flow:
      - get:
          url: "/#/Response_inspection"      
      - think: 5  

  - name: "Search Response_formats API"
    flow:
      - get:
          url: "/#/Response_formats"      
      - think: 5 

  - name: "Search Dynamic_data API"
    flow:
      - get:
          url: "/#/Dynamic_data"      
      - think: 5  

  - name: "Search Cookies API"
    flow:
      - get:
          url: "/#/Cookies"     
      - think: 5  

  - name: "Search Images API"
    flow:
      - get:
          url: "/#/Images"     
      - think: 5  

  - name: "Search Redirects API"
    flow:
      - get:
          url: "/#/Redirects"    
      - think: 5